#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>//标准输入输出头文件
#include<math.h>//数学头文件
#include<time.h>//时间头文件
#include<string.h>//字符串头文件
#include<stdlib.h>

//
//int main()
//{
//	int x = 011;
//	printf("%d", x);
//	return 0;
//}

//{
//	int a;
//	char b;
//	float c;
//	scanf("%d%c%f", &a, &b, &c);
//
//	return 0;
//}
//{
//	printf("%d\n", NULL);
//	return 0;
//}
////#define _CRT_SECURE_NO_WARNINGS
//#include<stdio.h>
//int main()
//{
//	char board[3][3];
//	int i = 0;
//	int j = 0;
//	for (i; i < 3; i++)
//	{
//		for (j; j < 3; j++)
//		{
//			printf(" %c ", board[i][j]);
//			if (j < 3 - 1)
//				printf("|");
//		}
//		if (i < 3 - 1)
//			printf("---|---|---\n");
//	}
//
//
//}
//int main()
//{
//	float r=0, h=0;
//	float cover=0;
//	float pi = 3.14;
//	scanf("%f%f", r, h);
//	cover = pi * r*r * 2 + 2 * pi * r * h;
//	printf("%.3f", cover);
//	return 0;
//}
//int main()
//{
//	int temp;
//	int a, b;
//	scanf("%d%d", &a, &b);
//	temp = a;
//	a = b;
//	b = temp;
//	printf("%d%d", a, b);
//	return 0;
//}
//23年9月22号   开始搞数组
//int main()
//{
//	char arr1[] = "abc";
//	char arr2[] = { 'a','b','c' };
//	printf("%d", sizeof(arr1));
//	printf("%d", sizeof(arr2));
//	printf("%d", strlen(arr1));
//	printf("%d", strlen(arr2));
//
//	
//	return 0;
//}





////试一试四舍五入?
//int main()
//{
//	float a = 1.55;
//	float b = 1.54;
//	float c = 1.56;
//	printf("%.1f\n%.1f\n%.1f\n", a, b, c);//
//	return 0;
//}
//int main()
//{
//	int score = 0;
//	scanf("%d", &score);
//	if (score < 0 || score>100)
//		return 0;
//
//	return 0;
//}
//
////int main()
//{
//	int profit = 0;
//	float bonus = 0;
//	scanf("%d", &profit);
//	if (profit <= 100000)
//		bonus = profit * 0.1;
//	if (profit > 100000 && profit <= 200000)
//		bonus = 100000 * 0.1 + (profit - 100000) * 0.075;
//	if (profit <= 400000 && profit > 200000)
//		bonus = 100000 * 0.1 + 100000 * 0.075 + (profit - 200000) * 0.05;
//	if (profit <= 600000 && profit > 400000)
//		bonus = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + (profit - 400000) * 0.03;
//	if (profit > 600000 && profit < 1000000)
//		bonus = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + (profit - 600000) * 0.015;
//	if (profit > 1000000)
//		bonus = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + 400000 * 0.015 + (profit - 1000000) * 0.01;
//	printf("%.2f", bonus);
//	return 0;
//}
////  Fibonacci sequence(斐波那契数列)的迭代实现
//long Fib(int x)
//{
//	int a = 1, b = 1, c = 1;
//	while (x > 2)
//	{
//		c = a + b;
//		b = c;
//		a = b;
//		x--;
//	}
//	return c;
//}

//  Fibonacci sequence(斐波那契数列)的递归实现
//int count = 0;
//long Fib(int x)
//{
//	int fib;
//	if (2 == x)//计算第二个斐波那契数计算次数----发现这个问题不适合用递归来解决 换个思路
//	{
//		count += 1;
//	}
//	if (x < 0)
//	{
//		printf("put error!\n");
//		return 0;
//	}
//	else if (0 == x || 1 == x)
//		return 1;
//	else
//	{
//		fib = Fib(x - 1) + Fib(x - 2);
//		return fib;
//	}
//
//}
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	long ret = Fib(n);
//	printf("%ld\n", ret);
//	//printf("%d次", count);
//	return 0;
//}


//算法实现n的阶乘(factorial)函数递归
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	long Factorial(int);
//	long m=Factorial(n);
//	printf("%d! = %11ld\n", n, m);
//	return 0;
//}
//
//long Factorial(int x)
//{	
//	long factorial;
//	if (x < 0)
//	{
//		printf("input  error!");
//		return 0;
//	}
//	else if (0 == x || 1 == x)
//		return 1;
//	else
//	{
//		factorial = x * Factorial(x - 1);
//		return factorial;
//	}
//}


//         /// <summary>
//				介是嘛? /// 
//         /// </summary>
//         /// <returns></returns>
//稍微简洁点的九九乘法表
//int main()
//{
//	int i,j;
//	for (i = 1; i <= 9;i++)
//	{
//		for (j = 1; j <= i; j++)
//		{
//			printf("%d*%d=%-2d ", i, j, i * j);
//			if(j==i)
//			{
//				printf("\n\n");
//				break;
//			}
//		
//		}
//	}
//	return 0;
//}

// ============================护体===================================
// ============================护体===================================
// ============================护体===================================

//二分查找(未完善
//int binary_search(int arr[],int k,int sz)
//{
//	int left = 0, right = sz;
//	int mid = (left + right) / 2;
//	if (arr[mid] > k)
//	{
//		right = mid + 1;
//	}
//
//
//
//
//
//}
//int main()
//{
//	int arr1[] = { 1,2,3,4,5,6,7,8,9 };
//	int k = 7;
//	int sz = strlen("arr1");
//	binary_search(arr1[], k, sz);
//	return 0;
//}
//int main()
//{
//	int a = 55;
//	float b = sqrt(a);
//	printf("%f\n", b);
//	return 0;
//}

// ============================护体===================================

//写个判断是否为素数的函数
//int is_prime(int x)
//{
//	int i = 2;
//	scanf("%d", &x);
//	for (i; i < sqrt(x); i++)
//	{
//		if (x % i == 0)
//		{
//			printf("%d不是素数,能被%d整除", x, i);
//			return 0;
//			/*break;*/
//		}
//		if (i == sqrt(x))
//		{
//			printf("%d是素数", x);
//			return 1;
//		}
//	}
// }
//
////判断一个数是否是素数
//int main()
//{	
//	int j = 0, n = 0; 
//	printf("判断素数,请输入一个数:<");
//	scanf("%d", &n);
//	is_prime(n);
//	return 0;
//}
	////////////for (j = 2; j < sqrt(n); j++)
	////////////{
	////////////	if (n % j == 0)
	////////////	{
	////////////		printf("%d不是素数,能被最小因子%d整除", n, j);
	////////////		j =2;
	////////////		
	////////////	}
	////////////	if (j == sqrt(n))
	////////////	{
	////////////		printf("%d是素数", n);
	////////////		goto end;
	////////////	}
	////////////}
	////////////end:
// ============================护体===================================

//int main()
//{
//	float f1, f2;
//	int i;
//	char ch = 'c';
//	scanf("%f %d %c %f", &f1, &i, ch, &f2);
//	printf("%c %d %f.2 %.2f", ch, i, f1, f2);
//
//	return 0;
//}

// ============================护体===================================
//goto命令在程序中的使用
//int main()
//{
//	char arr1[20] = {0};
//	system("shutdown -s -t 60");
//	again:
//	printf("你的电脑将在1分钟内关机,如果输入:我是猪  那么就不会关机\n请输入:");
//	scanf("%s", arr1);
//	if (strcmp(arr1, "我是猪") == 0)
//		system("shutdown -a");
//	else
//	{
//		printf("\n输入错误!!");
//		goto again;
//	}
//	return 0;
//}
// ============================护体===================================
// ============================护体===================================
// ============================护体===================================
//猜数字游戏!!!!!!!!
//void menu()
//{
//		printf("***请输入数字进入/退出****\n");
//		printf("*******0.  exit      1. paly*******\n");
//		printf("*****************************\n");
//
//}
//void game()
//{
//	//难点*生成一个随机数命名为a(arbitrary)!!
//	int a = 0;
//	int b = 0;
//	int count = 0;
//	a = rand()%100+1;
//	printf("请猜数字:");
//	//printf("%d", a);
//	while(1)
//	{
//		count++;
//		scanf("%d", &b);
//		if (a < b)
//		{
//			printf("输入的值大了\n");
//		}
//		else if (a > b)
//		{
//				printf("输入的值小了\n");
//		}
//		else
//		{
//				printf("恭喜你,蒙对了QWQ\n蒙了%d次\n",count);
//				break;
//		}
//	} 
//}
//int main()
//{
//	int n = 0;
//	srand((unsigned int)time(NULL));////此时这里生成的是1~2^16-1的随机数,怎么样才能缩小范围呢?    取余!!!!
//	do
//	{
//		//菜单
//		//printf("***请输入数字进入/退出****\n");
//		//printf("*******0.  Exit      1. Paly*******\n");
//		//printf("*****************************\n");
//		menu();
//		printf("请选择:<");
//		scanf("%d", &n);
//		switch (n)
//		{
//		case 1:
//			printf("开始游戏!\n");
//			game();
//			break;
//		case 0:
//			printf("退出游戏中,欢迎下次光临");
//			break;
//		default :
//			printf("输入错误请重试!\n");
//			break;
//		}
//
//	} while (n!=0);
//	return 0;
//}
// ============================护体===================================
// ============================护体===================================
// ============================护体===================================
//从小到大依次找到n个素数						(((((都是试除法)))))!!!!
//int main()
//{
//	int i, j, n;
//	int count = 1;
//	printf("输入一个数n,我将依次找到n个素数:");
//	scanf("%d", &n);
//	for (i = 3,count,n;count<=n; i += 2)
//	{
//		for (j = 2; j < i; j++)
//		{
//			if (0 == i % j)
//				break;
//		}
// 		while (i ==j)
//		{
//			count++;
//			printf("%d  ", i);	
//			break;
//		}
//		
//	}
//	
//	return 0;
//}
// ============================护体===================================
//找到范围内的所有素数并求个数
//int main()
//{
//	int bound_1, bound_2,count=0;
//	printf("请输入两个整数便于检索其中的素数:<");
//	scanf("%d%d", &bound_1, &bound_2);
//	for (bound_1, bound_2; bound_1 <=bound_2; bound_1++)
//	{
//		int j = 2;
//		for (j; j < bound_1; j++)
//		{
//			if (0 == bound_1 % j)
//				break;
//		}
//		if (j == bound_1)
//		{
//			count++;
//			printf("%6d  ", bound_1);//给数据设置宽度使格式整齐!! 
//			//printf("%d  ", bound_1);
//		}
//	}
//	printf("\n共有%4d个\n", count);
//	return 0;
//}
// ============================护体===================================
//判断闰年的算法
//int main()
//{
//	int year;
//	printf("输入一个公元年份:<");
//	scanf("%d", &year);
//	/*if (0 == year % 400)//////////////////////   Think   before  your	 act!!!	Think   before  your	 act!!!	Think   before  your	 act!!!
//	{
//		printf("%d年是闰年", year);
//	}*/
//	if (0 == year % 4 )
//	{
//		if (0 != year % 100)
//			printf("%d年是闰年", year);
//		else if (0 == year % 400)
//			printf("%d年是闰年", year);
//		else
//			printf("%d年不是闰年", year);
//	}
//	/*else 
//	{
//		printf("%d年不是闰年", year);
//	}*/
//	return 0;
//}
////用自定义函数判断闰年(leap year)
//int is_leap_year(int year)
//{
//	if ( (year % 4 == 0 )&& (year % 100 != 0) || (0==year % 400))
//		return 1;
//	return 0;
//}
//int main()
//{
//	int a = 0;
//	printf("判断闰年,请输入一个公元年份:<\n");
//	scanf("%d", &a);
//	if (1== is_leap_year(a))
//		printf("该年为闰年\n");
//	else
//		printf("该年不是闰年\n");
//
//
//	return 0;
//}

// ============================护体===================================
//用辗转相除法求最大公约数
//int main()
//{
//	int a, b, c;
//	printf("请输入两个整数求取最大公约数:<\n");
//	scanf("%d%d", &a, &b);
//
// while (a % b != 0)
//{
//		c = a % b;
//		a = b;
//		b = c;
//	}
//	printf("最大公约数:%d", c);
//	return 0;
//}
// ============================护体===================================
//将3个数据从大到小排列
//int main()
//{
//	int a, b, c;
//	scanf("%d%d%d", &a, &b, &c);
//	if (a < b)
//	{
//		int tmp = a;
//		a = b ;
//		b = tmp;/////交换值的时候要建立临时变量存储数值
//	}
//	if(a<c)
//	{
//		int tmp = a;
//		a = c;
//		c = tmp;
//	}
//	if (c > b)
//	{
//		int tmp = c;
//		c = b;
//		b = tmp;
//	}
//
//		printf("%d%d%d", a, b, c);
//	return 0;
//}

// ============================护体===================================
//搞个前n项阶乘的和
//int main()
// 
// 
//{
//	int i = 1, j = 1, sum = 0;
//	int n = 0;
//	printf("请输入一个整数:<\n");
//	scanf("%d", &n);				//输入12为什么i也跟着变成了12?
//	for (i=1; i <=n ; )//////for后面不要分号
//	{
//		sum += j;///////////之前写的顺序反了   结果错误!!
//		i++;
//		j *= i;
//	
//		//while (i == n)
//		//{
//		//	break;
//		//}/////while多余了
//	}
//	printf("和:%d", sum);
//
//	return 0;
//}
// ============================护体===================================
/////////////////////////////        for语句写九九乘法表
//int main()
//{
//	int i = 1, j = 1;
//	for (i = 1, j = 1;; j = 1,i++)
//	{
//		printf("%d*%d=%d  ", i, j, i * j);
//		for (i, j; i > j;)
//		{
//			j++;
//			printf("%d*%d=%-2d  ", i, j, i * j);   //宽度 对齐
//			//printf("%d*%d=%2d  ", i, j, i * j);
//			//printf("%d*%d=%d  ", i, j, i * j);
//		}
//		if (i == 9)
//			break;
//		printf("\n");
//	}
//	return 0;
//
// }
// ============================护体===================================
//计算n!
//int main()
//{
//	long int n = 0,i=0,m=1;
//	printf("请输入一个整数:");       //注意数值溢出
//	scanf("%d", &n);
//	while (i < n)
//	{
//		i++;
//		m =m* i;
//		if (i ==n)
//		{
//			printf("%ld", m);
//			break;
//		}
//	}
//	return 0;
//}
//int main()
//{
//	int i = 1, j = 1;
//	for (i, j ; i <= 9; )
//	{
//		int m = i * j;
//		printf("%d*%d=%d\n",i,j,m );
//		for (i, j; i >=j;j=1 )
//		{
//			int m = i * j;
//			printf("%d*%d=%d  ", i, j, m);
//			for (i, j; i > j; j++)										//不知所措
//			{
//				int m = i * j;
//				printf("%d*%d=%d  ",i,j,m);
//			}
//			i++;
//		}
//		
//	}
	//	return 0;
//
// ============================护体===================================
//int main()
//{
//	int  i = 1, j = 1;
//	while (i <= 9)
//	{
//		int m = i * j;
//		while (j < i)
//		{
//			int m = i * j;													//九九乘法表
//			printf("%d*%d=%d  ", i, j, m);
//			j++;
//		}
//		while (j == i)
//		{
//			int m = i * j;
//			printf("%d*%d=%d\n", i, j, m);
//			i++, j = 1;
//		}
//	}
//	return 0;
//}																				
// --------------------------------------------------------------------------------------------------------------------------
//	for (i = 1, j = 1; i != j; j++)
//	{
//		printf("%d*%d=%d  ", i, j, m);
//	}
//	while (i <= 9)
//	{
//		for (i, j; i !=j; j = 1)
//		{
//			j++;
//			int m = i * j;
//			printf("%d*%d=%d\n", i, j, m);
//			while(j<i)
//			for (i, j; i == j; )
//			{
//				++i;
//				m = i * j;
//				printf("%d*%d=%d   ", i, j, m);
//			}
//		}
//	}
//	return 0;
//{
//    int a, b, c, d, e;
//    scanf("%d%d", &a, &b);
//    c = a + b, d = a - b, e = a * b;
//    printf("%d + %d= %d\n ", a, b, c);
//    printf("%d - %d= %d\n ", a, b, d);
//    printf("%d * %d= %d\n ", a, b, e);
//    if (a % b == 0)
//    {
//        int f = a / b;
//        printf("%d / %d= %d\n", a, b, f);
//    }
//    else
//    {
//        float f = a / b;
//        printf("%d / %d= %.2f\n ", a, b, f);
//    }
//    return 0;
//}
////int main()
////{
////	int a, b;
////	scanf("%d%d",&a,&b);
////	if (a % b == 0)
////	{
////	    int	c = a / b;
////		printf("%d/%d=%d", a, b, c);
////	}
////	else
////	{
////		float c = static_cast<float>(a) / b;
////		printf("%d/%d=%.2f", a, b, c);
////	}
////	return 0;
////}
//
//
////护体-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//
////int main()
////{
////    int a, b, c, d, e, f;
////    scanf("%d%d", &a, &b);
////    c = a + b, d = a - b, e = a * b, (float)f = a / b;
////    printf("%d + %d= %d\n ", a, b, c);
////    printf("%d - %d= %d\n ", a, b, d);
////    printf("%d * %d= %d\n ", a, b, e);
////    if (a % b == 0)
////    {
////        printf("%d / %d= %d\n", a, b, f);
////    }
////    else
////    {
////        printf("%d / %d= %.2f\n ", a, b, (float)f);
////    }
////    return 0;
////}
////护体-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//
////int main()
////{
////	int i = 0;
////		while (i < 100)
////		{
////			if (1 == i % 2)
////				printf("奇数:%d\n", i);
////			i += 1;
////		}
////
////
////	return 0;
////}
////护体-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//
////{
////	int i = 0;
////	while (i < 100)
////	{
////		if (0 == i % 2)									
////		{
////			i++;
////		}
////		else
////		{
////			printf("奇数=%d\n", i);						一百以内奇数
////			i++;
////		}
////	}
////	return 0;
////}
////护体-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//
////int main()
////{
////    int a, b, c, d, e;
////    float f;
////    scanf("%d%d", &a, &b);
////    c = a + b, d = a - b, e = a * b, f = a / b;
////    printf("%d + %d= %d\n ", a, b, c);
////    printf("%d - %d= %d\n ", a, b, d);
////    printf("%d * %d= %d\n ", a, b, e);
////    if (a % b == 0)
////    {
////        printf("%d / %d= %d\n", a, b, f);
////    }
////    else
////    {
////        printf("%d / %d= %.2f\n ", a, b, f);
////    }
////    return 0;
////}
////int main()
////{
////	int a, b, c, d, e;
////	float f;
////	scanf("%d%d", &a, &b);
////	c = a + b, d = a - b, e = a * b, f = (float)a / b;
////	printf("%d + %d= %d\n ", a, b, c);
////	printf("%d - %d= %d\n ", a, b, d);
////	printf("%d * %d= %d\n ", a, b, e);
////	printf("%d / %d= %.2f\n ", a, b, f);
////	return 0;
////}
////护体-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//
////#include<stdio.h>
////int Add(int x, int y)
////{
////	printf("输入两个整数:\n");
////	scanf("%d%d", &x, &y);
////	int z = x + y;
////	return z;
////}
////int main()
////{
////	int a = 0, b = 0;
////	int c = Add(a, b);
////	printf("和:%d\n", c);
////	return 0;
////}
////护体-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//
//
////#include<stdio.h>
////int Add(int x,int y)
////{
////	
////	printf("请输入两个整数:\n");
////	scanf("%d%d", &x, &y); 
////	int z = x + y;
////	return z;
////}
////int main()
////{
////	int a = 0, b = 0, c = 0;
////	 c = Add(a, b);
////	 printf("和:%d", c);
////	return 0;
////}
////护体-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
////#include<stdio.h>
////int  main()
////{
////	int x = 1, y = 2;
////	int z = x + y;
////	printf("和:%dn\n", z);
////	
////	return 0;
////}
////int Max(int x, int y)
////{
////	int z = (x > y ? x : y);
////	printf( "max=%d", z);
////	return z;
////}
////int main()
////{
////	int num_1 = 0, num_2 = 0;
////	scanf("%d%d",&num_1,&num_2);
////	Max(num_1, num_2);
////	return 0;
////}
//
//
//
//
//
////护体-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
////int main()
////{
////	int a = 0, b = 3, c = 2;
////	return a && b || c;
////}
////护体-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
////int main()
////{
////	int a = 0, b = 3, c = 2;
////	printf("%d", a && b || c);
////	return 0;
////}
//
//
//
//
////护体-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
////
////int max(int x, int y)
////{
////	int max(x > y ? x : y);
////	return max;
////}
////int main()										三目操作符(eg1?eg2:eg3)比大小
////{
////	int num_1 = 0, num_2 = 0;
////	printf("请依次输入两个数:");
////	scanf("%d%d", &num_1, &num_2);
////	int c = max(num_1, num_2);
////	printf("较大的数:%d\n", c);
////	return 0;
////}
////}-----------------------------------------------------------------------------------------------------------------------------------------------------------------
////int Max(int x, int y)
////{
////	int z = 0, max = 0;
////	if (x>y)
////	{
////		printf("大的数:%d/n", x);
////		z = x;
////	}
////	else
////	{														比大小
////		printf("大的数:%d\n", y);
////		z = y;
////	}
////	return  z;
////}
////int main()
////{
////	int num1 = 0, num2 = 0, max = 0;
////	printf("num1=");
////	scanf("%d", &num1);
////	printf("\nnum2=");
////	scanf("%d", &num2);
////	max=Max(num1, num2);
////	//printf("max=%d\n", max);    无关紧要
////}-----------------------------------------------------------------------------------------------------------------------------------------------------------------
//
//
//
//
//
//
////int main()
//// 
////{
////	int a = 100, b = 200;
////	int max = (a > b ? a : b);                examp
////	printf("max=%d", max);
////	return 0;
////}
//
/*nt Add(int x, int y)
//{
//	int z = x + y;
//	return z;
//
//
//}
//int main()
//{
//	int num1 = 0, num2 = 0;
//	printf("num1=");
//	scanf("%d", &num1);
//	printf("num2=");
//	scanf("%d", &num2);
//	int sum = Add(num1, num2);
//	printf("sum=%d\n", sum);
//	return 0;
//}*/
//
//
//
//
//
////int Max(int x, int y)//定义函数
////{
////	if (x > y)
////	{
////		return x;
////	}
////	else
////	{
////		return y;
////	}
////}
////int main()
////{
////	int num1 = 0, num2 = 0;
////	printf("num1=");
////		scanf("%d", &num1);
////	printf("num2=");
////		scanf("%d", &num2);
////	int max = Max(num1, num2);
////	printf("max=%d", max);
////	return 0;
////}